app/Views/quotation/list.php

SELECT *
FROM `clients`
WHERE `clients`.`id` = '48'
---
<td>
<?php
$clientModel = new \App\Models\ClientModel();
$client = $clientModel->find($q['client_id']);