app/Controllers/Accounts.php

SELECT *
FROM `accounts`
---
public function index()
{
    $role = session()->get('role');
    $access = session()->get('module_access') ?? [];

    if (!is_array($access)) {
        $access = explode(',', $access);
    }

    $access = array_map('trim', $access);
    $access = array_map('strtolower', $access);

    // 🔐 ACCESS CHECK
    if (strtolower(trim($role)) != 'admin' && !in_array('account', $access)) {
        return redirect()->to('dashboard')->with('error', 'Access Denied');
    }

    // ✅ DATA LOAD
    $model = new \App\Models\AccountModel();
    $data['accounts'] = $model->findAll();