app/Controllers/Auth.php

public function checkLogin()
{
    $email = $this->request->getPost('email');
    $password = $this->request->getPost('password');

    $model = new UserModel();
    $clientModel = new ClientModel(); // ✅ ADD

    $user = $model->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'ara@gmail.com'
 LIMIT 1