app/Controllers/BaseController.php

   public function initController(RequestInterface $request, ResponseInterface $response, LoggerInterface $logger)
{
    parent::initController($request, $response, $logger);

    // ✅ Get current controller name
   $currentController = strtolower($request->getUri()->getSegment(1));

    // ❗ Skip for dashboard or auth (IMPORTANT)
    $skip = ['dashboard', 'auth'];

    if (session()->get('user_id')) {

    $userModel = new \App\Models\UserModel();
    $user = $userModel->find(session()->get('user_id'));
---
SELECT *
FROM `users`
WHERE `users`.`id` = '17'