app/Controllers/Dashboard.php

SELECT COUNT(*) AS `numrows` FROM `users`
SELECT COUNT(*) AS `numrows` FROM `clients`
SELECT COUNT(*) AS `numrows` FROM `sales`
---
    public function index()
{
    // ✅ Counts
    $userModel   = new UserModel();
    $clientModel = new ClientModel();
    $salesModel  = new SalesModel();
    $orderModel  = new OrderModel();



    $data['total_users']   = $userModel->countAll();
    $data['total_clients'] = $clientModel->countAll();
    $data['total_sales']   = $salesModel->countAll();

SELECT *
FROM `users`
WHERE `users`.`id` = '17'
---
$data['modules'] = $modules;

    $userModel = new \App\Models\UserModel();
    $user = $userModel->find(session()->get('user_id'));