app/Controllers/Factory.php

    public function index()
    {
        $model = new FactoryModel();
        $data['factory'] = $model->findAll();
---
SELECT *
FROM `factory`