app/Controllers/Order.php

public function index()
{
    $session = session();

    $role = $session->get('role');
    $access = $session->get('module_access') ?? [];

    // convert to array
    if (!is_array($access)) {
        $access = explode(',', $access);
    }

    $access = array_map('trim', $access);
    $access = array_map('strtolower', $access);

    // =========================
    // ✅ 1. GET DB ORDERS
    // =========================
    $model = new \App\Models\OrderModel();
    $dbOrders = $model->findAll();
---
SELECT *
FROM `orders`