app/Controllers/Quotation.php

SELECT *
FROM `quotations`
---
    public function list()
    {
        $model = new QuotationModel();
        $data['quotations'] = $model->findAll();