app/Controllers/Sales.php

public function list()
{
    $model = new SalesModel();

    // Get search value from URL
    $tracking = $this->request->getGet('tracking');

    $builder = $model
        ->select('sales.*,
                  clients.first_name AS client_first,
                  clients.last_name AS client_last,
                  users.first_name AS cad_first,
                  users.last_name AS cad_last')
        ->join('clients', 'clients.id = sales.client_id', 'left')
        ->join('users', 'users.id = sales.cad_user_id', 'left');

    // Apply search filter
    if (!empty($tracking)) {
        $builder->like('sales.tracking_number', $tracking);
    }

    $data['sales'] = $builder->findAll();
---
SELECT `sales`.*, `clients`.`first_name` AS `client_first`, `clients`.`last_name` AS `client_last`, `users`.`first_name` AS `cad_first`, `users`.`last_name` AS `cad_last`
FROM `sales`
LEFT JOIN `clients` ON `clients`.`id` = `sales`.`client_id`
LEFT JOIN `users` ON `users`.`id` = `sales`.`cad_user_id`