app/Controllers/Settings.php

  public function index()
{
    $userModel = new \App\Models\UserModel();

    $userId = session()->get('user_id');

    $data['settings'] = $userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '17'

public function updatePassword()
{
    $userModel = new \App\Models\UserModel();

    // ✅ FIXED: correct session key
    $id = session()->get('user_id');

    $user = $userModel->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '17'