app/Controllers/Shipping.php

    public function index()
    {
        // ✅ Check access
        $this->checkAccess('shipping');

        $model = new ShippingModel();

        $tracking_number = $this->request->getGet('tracking_number');
        $status = $this->request->getGet('status');
        $dispatch_date = $this->request->getGet('dispatch_date');

        $query = $model
            ->select('shipping.*, clients.first_name, clients.last_name')
            ->join('clients', 'clients.id = shipping.client_id', 'left');

        if (!empty($tracking_number)) {
            $query->like('tracking_number', $tracking_number);
        }

        if (!empty($status)) {
            $query->where('status', $status);
        }

        if (!empty($dispatch_date)) {
            $query->where('dispatch_date', $dispatch_date);
        }

        $data['shipping'] = $query->findAll();
---
SELECT `shipping`.*, `clients`.`first_name`, `clients`.`last_name`
FROM `shipping`
LEFT JOIN `clients` ON `clients`.`id` = `shipping`.`client_id`

    public function create($id = null)
{
    $this->checkAccess('shipping');

    $shippingModel = new ShippingModel();
    $clientModel   = new ClientModel();

    $last   = $shippingModel->orderBy('id', 'DESC')->first();
    $nextId = $last ? $last['id'] + 1 : 1;

    $data['gfj_no'] = 'GFJ' . str_pad($nextId, 4, '0', STR_PAD_LEFT);
    $data['tracking_number'] = 'TRK' . date('Ymd') . str_pad($nextId, 3, '0', STR_PAD_LEFT);

    $data['clients'] = $clientModel->findAll();
---
SELECT *
FROM `shipping`
ORDER BY `id` DESC
 LIMIT 1
SELECT *
FROM `clients`