app/Controllers/User.php

SELECT *
FROM `users`
---
public function list()
{
    $model = new \App\Models\UserModel();
    $data['users'] = $model->findAll();